# Commands
cmd_start =
    👀 ای جوینده‌ی دلقک شماری، خوش اومدی!

    من یه رباتم که آمار دلقک بودن همگروهی‌هاتون رو مدیریت می‌کنم. من به رو به گروهت اضافه کن و با ریپلای کردن دستور clown/ روی همگروهی‌هات، امتیاز دلقکیشون رو افزایش بده!

    می‌تونی با ریپلای کردن «دلقک» و «🤡» هم این کار رو انجام بدی، ولی قبلش لازمه که بهم اجازه‌ی دیدن پیام‌ها رو بدی و برا این کار نیازه که ادمینم کنی.

    🔏 حریم شخصی: /privacy
    🖥 سورس‌کد پروژه: /privacy

    🤡 @ClownCounterBot

cmd_privacy =
    🔒 حریم شخصی کاربران

    ربات دلقک شمار رباتی برای خوش‌گذرونی بین شما و دوستانتونه. اما ممکنه برای برخی این نگرانی رو به وجود بیاره که «این ربات چقدر دسترسی داره؟»
    قطعا خوندن این متن قرار نیست چیزی رو ثابت کنه، اما در نهایت نوشتنش رو به ننوشتنش ترجیح دادیم.

    🗃 چه اطلاعاتی ذخیره میشن؟

    این ربات تنها اطلاعات کلیدی‌ای که بدون اون‌ها نمی‌تونه کار کنه رو ذخیره می‌کنه. اعم از نام و آیدی عددی گروه، دلقک کننده، دلقک شونده و زمان دلقک شدن افراد. این‌ها تنها داده‌هایی هستن که در دیتابیس ربات ذخیره میشن و بدون اون‌ها عملا نمی‌تونه کار کنه و چاره‌ای جز ذخیره‌سازیشون نداریم.

    🕵️‍♂️ آیا گفتگوها جایی نوشته میشن؟

    خیر! ربات بصورت پیشفرض هیچ تمایلی به حتی دریافت پیام کاربران هم نداره. تنها در صورتی که مایلید از دستورات متنی مانند «دلقک» و «🤡» استفاده کنید و به ما اعتماد کافی دارید، می‌تونید اون رو ادمین کنید (با حداقل دسترسی) تا به ربات این اجازه رو بدید که این دستورات متنی رو ببینه و بهشون جواب بده.

    👨‍💻 آیا سورس‌کد پروژه موجوده؟

    بله! این ربات تماما متن‌باز هست و می‌تونید با دستور /source بهش دسترسی داشته باشید.

    ❤️ امیدواریم که در حین استفاده از این ربات حسابی بهتون خوش بگذره!

cmd_source =
    ✨ دلقک‌شمار یک پروژه متن‌بازه!

    این به این معنیه که شما دسترسی کامل به سورس‌کد این ربات دارین و می‌تونید روی سرور خودتون اجراش کنید، شخصی‌سازیش کنید یا حتی به توسعه‌ش کمک کنید!

    🪄 ریپازیتوری پروژه:
    https://github.com/haashemi/clown-counter-bot

cmd_stats_no_clown =
    دلقک‌های گروه شما هنوز مشخص نیست.

    نظرت چیه اولیش خودت باشی؟ 🤡

cmd_stats_group =
    🔥 دلقک‌های برتر گروه

    { $clowns }

cmd_stats_group_clown = {"\u200F"}— { $name } با { $votes } رای

cmd_clown_is_me = 🤡 آره داداش بذار ربات رو دلقک کنم خیلی کار باحالیه به ذهن کسی هم نمی‌رسه ای وای که چقدر باهوشم من. پر از هوش و ذکاوت و استعداد نهفته دارم اینجا حیف میشم. خندیدیم داداش، حالا لفت بده. 🙏
cmd_clown_is_bot = 🥰 عزیزم، اینی که می‌خوای دلقکش کنی، یه رباته. ربات یک شخص نیست. نمی‌تونه دلقک باشه.
cmd_clown_is_you = دا؟ خودت رو می‌خوای دلقک کنی؟ چرا آخه؟ هم صحبت نیاز داری؟ کاری از دست ما بر میاد؟ 😭
cmd_clown_wait = ⏳ هنوز زوده! { $waitMin } دقیقه دیگه می‌تونی دلقک کنی.
cmd_clown = {"\u200F"}🤡 { $clown } توسط { $voter } دلقک شد!