import type { Context } from "grammy";

export const onPrivacy = (c: Context) => {
  return c.reply(`🔒 حریم شخصی کاربران

ربات دلقک شمار رباتی برای خوش‌گذرونی بین شما و دوستانتونه. اما ممکنه برای برخی این نگرانی رو به وجود بیاره که «این ربات چقدر دسترسی داره؟»
قطعا خوندن این متن قرار نیست چیزی رو ثابت کنه، اما در نهایت نوشتنش رو به ننوشتنش ترجیح دادیم.

🗃 چه اطلاعاتی ذخیره میشن؟

این ربات تنها اطلاعات کلیدی‌ای که بدون اون‌ها نمی‌تونه کار کنه رو ذخیره می‌کنه. اعم از نام و آیدی عددی گروه، دلقک کننده، دلقک شونده و زمان دلقک شدن افراد. این‌ها تنها داده‌هایی هستن که در دیتابیس ربات ذخیره میشن و بدون اون‌ها عملا نمی‌تونه کار کنه و چاره‌ای جز ذخیره‌سازیشون نداریم.

🕵️‍♂️ آیا گفتگوها جایی نوشته میشن؟

خیر! ربات بصورت پیشفرض هیچ تمایلی به حتی دریافت پیام کاربران هم نداره. تنها در صورتی که مایلید از دستورات متنی مانند «دلقک» و «🤡» استفاده کنید و به ما اعتماد کافی دارید، می‌تونید اون رو ادمین کنید (با حداقل دسترسی) تا به ربات این اجازه رو بدید که این دستورات متنی رو ببینه و بهشون جواب بده.

👨‍💻 آیا سورس‌کد پروژه موجوده؟

بله! این ربات تماما متن‌باز هست و می‌تونید با دستور /source بهش دسترسی داشته باشید.

❤️ امیدواریم که در حین استفاده از این ربات حسابی بهتون خوش بگذره!`);
};
