import type { Context } from "grammy";

export const onStart = (ctx: Context) => {
  ctx.reply(`👀 ای جوینده‌ی دلقک شماری، خوش اومدی!

من یه رباتم که آمار دلقک بودن همگروهی‌هاتون رو مدیریت می‌کنم. من به رو به گروهت اضافه کن و با ریپلای کردن دستور clown/ روی همگروهی‌هات، امتیاز دلقکیشون رو افزایش بده!

می‌تونی با ریپلای کردن «دلقک» و «🤡» هم این کار رو انجام بدی، ولی قبلش لازمه که بهم اجازه‌ی دیدن پیام‌ها رو بدی و برا این کار نیازه که ادمینم کنی.

🔏 حریم شخصی: /privacy
🖥 سورس‌کد پروژه: /privacy

🤡 @ClownCounterBot`);
};
